import style from './AboutProject.module.scss'

export const AboutProject = () => {

    return (
        <section className={style.aboutProject}>
            <h1>Інформація про сервіс</h1>
            <p>Сайт Service-desk створений на базі фреймворку React із використанням JavaScript, TypeScript, HTML, CSS та сервісу MockAPI для базового імітування роботи з базою даних. </p>
            <p>Основною перевагою цього проєкту є застосування технології SPA (Single Page Application), завдяки якій сторінка не перезавантажується при переході між розділами сайту. Замість цього відбувається динамічне оновлення контенту, що значно підвищує швидкість роботи сервісу та покращує користувацький досвід. Завдяки SPA сайт завантажується набагато швидше: на даний момент сторінки завантажуються за 300 мс, що є доволі гарним результатом для веб-додатків цього типу. (рис. 1)</p>
            <p>Ще однією важливою перевагою є компонентна архітектура React, яка дозволяє легко додавати, видаляти або змінювати окремі елементи інтерфейсу без значного впливу на загальну структуру сайту. Це забезпечує гнучкість і зручність у подальшій розробці та підтримці проєкту. (рис. 2)</p>
            <aside className="flex">
                <div>
                    <img src="./siteLoad.png" alt="" />
                    <p>Рис 1</p>
                </div>
                <div>
                    <img src="./siteStructura.png" alt="" />
                    <p>Рис 2</p>
                </div>
            </aside>
            <p>На даний момент сайт не є повністю адаптивним, однак він повністю виконує свій функціонал зі створення, погодження та виконання заявок користувачів. Особливістю оновленої версії є сортування заявок: ті, що мають таймер або статус Expired, автоматично розташовуються на початку списку, що дозволяє зручніше контролювати їх виконання.</p>
            <p>У зв'язку з відсутністю доступу до певних даних, користувачів необхідно вказувати вручну при створенні заявки. Також у секції "Мої заявки" відображаються всі заявки, незалежно від того, хто їх створив. Завдяки використанню MockAPI, сайт має інтернет-базу даних, що дозволяє будь-якому користувачу переглядати всі створені заявки. Це рішення було реалізоване для демонстрації, як працюватиме сервіс у реальному середовищі.</p>
        </section>
    )
}